; Напишите программу, считающую НОД двух положительных чисел.
; Числа передаются через регистры RDI и RSI, результат должен быть помещен в регистр RAX.
;
; https://cs.itmo.ru/courses/51/modules/178/tasks/900

loop:
  test rdi,     rdi ; Проверим, не 0 ли первое число
  jz  end          ; Если 0 - завершаем программу

  test rsi,     rsi ; Проверим, не 0 ли второе число
  jz  end          ; Если 0 - завершаем программу

  cmp  rdi,     rsi ; Проверим, больше ли первое число второго
  ja   greater      ;

  ; Запоминаем остаток от деления второго на первое
  xor rdx, rdx ; Зануляем остаток от деления

  mov rax, rsi ; Записываем в делимое второе число
  div rdi      ; Делим на первое

  mov rsi, rdx ; Записываем остаток как второе число

  jmp  loop

  greater:

  ; Запоминаем остаток от деления первого на второе
  xor rdx, rdx ; Зануляем остаток от деления

  mov rax, rdi ; Записываем в делимое первое число
  div rsi      ; Делим на второе

  mov rdi, rdx ; Записываем остаток как первое число

  jmp loop
end:

mov rax, rdi ; Записываем первое число в ответ
add rax, rsi ; Прибавляем второе число к ответу
